Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment_atlantis will be created
+ resource "aws_autoscaling_attachment" "asg_attachment_atlantis" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb"
      + autoscaling_group_name = "atlantis_ecs"
      + id                     = (known after apply)
    }

  # aws_launch_configuration.ubuntu_20_04 must be replaced
-/+ resource "aws_launch_configuration" "ubuntu_20_04" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:398963803929:launchConfiguration:71b79a0b-602f-48e5-b098-ce0909d5979c:launchConfigurationName/atlantis_ecs" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "atlantis_ecs" -> (known after apply)
      + key_name                         = (known after apply)
        name                             = "atlantis_ecs"
      + name_prefix                      = (known after apply)
      - security_groups                  = [] -> null
      + user_data                        = "8428bcb25ea4644ae5badd4df1cfb7e662176f98" # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (4 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
